/* Dialog Strings */
"SAVE" = "Tallenna";
"DONTSAVE" = "Älä tallenna";
"CANCEL" = "Kumoa";
"DELETE" = "Poista";
"OK" = "OK";
"APPLY" = "Käytä";
"REVERT" = "Palaa tallennettuun";
"DONTAPPLY" = "Älä käytä";
"CONTINUE" = "Jatka";
"NONE" = "Ei mitään";
"ASSIST" = "Avusta…";
"NEW_ISP" = "Uusi palveluntarjoaja…";
"CREATE" = "Luo";
"DO_NOT_CREATE" = "Älä luo";
"UNKNOWN" = "Tuntematon";
"DONE" = "Valmis";
"AUTHENTICATE" = "Todenna";
"DEAUTHENTICATE" = "Poista todentaminen";

"ADVANCED" = "Lisävalinnat";
"SETUP" = "Määrittele…";
"CONNECT" = "Yhdistä";
"DISCONNECT" = "Katkaise";
"DIAL_NOW" = "Valitse nyt";

"EDIT_BUTTON_RENAME" = "Nimeä uudelleen";
"EDIT_BUTTON_EDIT" = "Muokkaa…";

"LINK_AGGREGATE" = "Linkkien yhdistäminen";

/* Panel Strings */
"SAVE_CONFIG" = "Käytetäänkö määrittelymuutoksia?";
"IP_FROM_SERVER" = "IP-osoite: Saadaan palvelimelta\n";
"IP_ADDR" = "IP-osoite: %@\n";
"DELETE_LOC" = "Haluatko varmasti poistaa käyttöpaikan ”%@”?";
"DELETE_CFG" = "Haluatko varmasti poistaa määrittelyn ”%@”?";
"DELETE_SERVICE" = "Haluatko varmasti poistaa palvelun ”%@”?";
"NO_UNDO_DESC" = "Toimintoa ei voida perua.";
"DELETE_SERVICE_MULTIPLE_SETS_TITLE" = "Palvelulla ”%@” on useita käyttöpaikkoja";
"DELETE_SERVICE_MULTIPLE_SETS_MESSAGE" = "Haluatko poistaa sen kaikista käyttöpaikoista vai vain nykyisestä käyttöpaikasta?";
"DELETE_SERVICE_MULTIPLE_SETS_DEFAULT_BUTTON" = "Poista kaikista";
"DELETE_SERVICE_MULTIPLE_SETS_ALTERNATE_BUTTON" = "Poista nykyisestä";
"RENAME_CFG" = "Muuta määrittelyn nimeä:";
"RENAME_SERVICE" = "Syötä uusi nimi palvelulle ”%@”.";
"CREATE_CFG" = "Luo uusi määrittely nimeltään:";
"CREATE_SERVICE" = "Luo uusi palvelu nimeltään:";
"DUPLICATE_SERVICE" = "Syötä nimi kohteen ”%@” kopiolle.";
"AUTOMATIC_CFG" = "Automaattinen";
"DEFAULT_CFG" = "Oletus";
"UNTITLED_CFG" = "Nimetön";
"CFG_NAME" = "Määrittelyn nimi:";
"CFG_COPY_NO_FORMAT" = "Kopioi";
"CFG_COPY" = "%@ kopio";
"AIRPORT_ID" = "AirPort ID:";
"ENET_ID" = "Ethernet-osoite:";
"DEFAULT_PPPoE_SERVICE_NAME" = "PPPoE";
"INVALID_NAME" = "Virheellinen nimi";
"DUPLICATE_NAME" = "Nimen on oltava ainutkertainen";
"INVALID_VLAN_TAG" = "Tagi on alueen ulkopuolella";
"DUPLICATE_VLAN_TAG" = "Tagin on oltava ainutkertainen";
"TURN_AIRPORT_OFF" = "Sammuta AirPort";
"TURN_AIRPORT_ON" = "Kytke AirPort päälle";
"AIRPORT_POWER_ON" = "Päällä";
"AIRPORT_POWER_OFF" = "Pois";
"VPN_TITLE" = "VPN (%@)";
"L2TP_TITLE" = "L2TP";
"PPTP_TITLE" = "PPTP";
"CISCO_IPSEC_TITLE" = "Cisco IPSec";
"IPSEC_TITLE" = "IPSec";

"6 to 4" = "6 -> 4";

"MODEM_GENERIC" = "Yleinen";
"MODEM_OTHER" = "Muu";

"UNTITLED_INTERFACE" = "Nimetön";
"UNTITLED_SERVER" = "Nimetön palvelin";

"ALERT_UNSAVED_CHANGES_FORMAT" = "Palvelussa ”%@” on muutoksia, joita ei ole otettu käyttöön. Haluatko ottaa ne käyttöön?";
"ALERT_UNSAVED_CHANGES" = "Palvelussa on tallentamattomia muutoksia";
"ALERT_UNSAVED_CHANGES_EXIT" = "Haluatko tallentaa muutokset ennen Verkko-asetuspaneelin sulkemista?";
"ALERT_UNSAVED_CHANGES_IMPORT" = "Tuominen aiheuttaa tallentamattomien muutosten menettämisen. Haluatko tallentaa muutokset ennen määrittelyn tuomista?";
"ALERT_UNSAVED_CHANGES_SWITCH" = "Haluatko tallentaa muutokset ennen palveluiden vaihtamista?";
"ALERT_UNSAVED_CHANGES_LOCATION_SWITCH" = "Haluatko käyttää muutoksia ennen käyttöpaikan vaihtamista?";
"ALERT_UNSAVED_CHANGES_LOCATION_EDIT" = "Haluatko käyttää muutoksia ennen käyttöpaikan muokkaamista?";
"ALERT_UNSAVED_CHANGES_TOGGLE_AIRPORT_POWER" = "Jos laitat AirPortin päälle tai pois päältä, tallentamattomat muutokset menetetään. Haluatko ottaa muutokset käyttöön ennen kuin laitat AirPortin päälle tai pois päältä?";
"ALERT_UNSAVED_CHANGES_TOGGLE_DHCP_LEASE" = "DHCP-lainan uusiminen aiheuttaa tallentamattomien muutosten menettämisen. Haluatko tallentaa muutokset ennen DHCP-lainan uusimista?";
"ALERT_UNSAVED_CHANGES_CONNECTING" = "Jos yhdistät ottamatta muutoksia käyttöön, yhdistämisessä käytetään aiempia asetuksia. Haluatko ottaa muutokset käyttöön ennen yhdistämistä?";

"DELETE_VLAN_MULTIPLE" = "%d verkkopalvelua käyttää tätä VLANia.";
"DELETE_VLAN_ONE" = "Verkkopalvelu käyttää tätä VLANia.";
"DELETE_VLAN" = "Haluatko varmasti poistaa VLAN-verkon ”%@”?";
"DELETE_VLAN_INFO" = "Jos poistat VLANin, kaikki VLANia käyttävät verkkopalvelut poistetaan. Palveluiden tai VLANien poistamista ei voida perua. Haluatko varmasti poistaa VLANin ja siihen liittyvät määritykset?";

"DELETE_BOND_MULTIPLE" = "%d verkkopalvelua käyttää tätä yhdistelmää.";
"DELETE_BOND_ONE" = "Verkkopalvelu käyttää tätä yhdistelmää.";
"DELETE_BOND" = "Haluatko varmasti poistaa yhdistelmän ”%@”?";
"DELETE_BOND_INFO" = "Jos poistat yhdistelmän, kaikki yhdistelmää käyttävät verkkopalvelut poistetaan. Palveluiden ja yhdistelmien poistamista ei voida perua. Haluatko varmasti poistaa yhdistelmän ja siihen liittyvät määritykset?";
"UNTITLED_VLAN" = "Nimetön VLAN";
"UNTITLED_BOND" = "Nimetön sidos";

"BOND_MEMBER_STATUS_ALL_CONNECTED" = "Kaikki jäsenliitännät on liitetty.";
"BOND_MEMBER_STATUS_SOME_CONNECTED" = "Osa jäsenliitännöistä on liitetty. Lisätietoja saat osoittamalla Lisävalinnat.";
"BOND_MEMBER_STATUS_NONE_CONNECTED" = "Yhtään jäsenliitäntää ei ole liitetty. Lisätietoja saat osoittamalla Lisävalinnat.";

"NEW_INTERFACE" = "Uusi liitäntä havaittu";
"SAVE_INTERFACE" =  "Uusi verkkoliitäntä on havaittu:\r\r%@\r\rVarmista, että se on määritelty oikein, ja aktivoi se osoittamalla Käytä.";

"NEW_INTERFACES" = "Uusia liitäntöjä havaittu";
"SAVE_INTERFACES" =  "Uusia verkkoliitäntöjä on havaittu:\r\r%@\r\rVarmista, että ne on määritelty oikein, ja aktivoi ne osoittamalla Käytä.";

/*
"NEW_PORT" = "New Port Detected";
"SAVE_PORT" =  "A new network port has been detected:\r\r\t%@\r\rPlease verify that it is configured correctly, then press Apply Now to activate it.";

"NEW_PORTS" = "New Ports Detected";
"SAVE_PORTS" = "New network ports have been detected:\r\r\t%@\r\rPlease verify that they are configured correctly, then press Apply Now to activate them.";
*/

/* "Make Service Active" = "Make “%@” Active"; */
/* "Make Service Inactive" = "Make “%@” Inactive"; */
"Make Service Active" = "Aktivoi palvelu";
"Make Service Inactive" = "Inaktivoi palvelu";

"Remove Service" = "Poista palvelu ”%@”…";
"Duplicate Service" = "Monista palvelu ”%@”…";
"Rename Service" = "Nimeä uudelleen palvelu ”%@”…";
"DELETE_WITH_NAME" = "Poista ”%@”…";
"EDIT_WITH_NAME" = "Muokkaa ”%@”…";

/* Location Menu */
"EDIT_LOCATIONS" = "Muokkaa käyttöpaikkoja…";

/* transmitting and receiving */
"tx" = "tx";
"rx" = "rx";

/* miscellaneous terms returned from configd or systemconfig */
"full" = "kaksi";
"half" = "half";
"full-duplex" = "kaksisuuntainen";
"half-duplex" = "half-duplex";
"flow" = "flow";
"flow-control" = "vuonhallinta";
"auto" = "autom.";
"autoselect" = "automaattinen valinta";

/* misc service title */
"UNKNOWN_SERVICE" = "Tuntematon palvelu";

/* status strings */
"Inactive" = "Inaktiivinen";
"Connected" = "Yhteydessä";
"Connecting" = "Yhdistetään…";
"Disconnecting" = "Katkaistaan…";
"Some Connected" = "Jotkin liitetty";
"Not Connected" = "Ei yhteydessä";
"Not Configured" = "Ei määritelty";
"Unknown State" = "Tuntematon tila";
"Cable Unplugged" = "Kaapeli irrotettu";

"Self-Assigned IP" = "Itsemääritelty IP";
"No IP Address" = "Ei IP-osoitetta";
"Loopback IP" = "Loopback-osoite";


/* tab labels */
"airport" = "AirPort";
"pppaccounts" = "Tilit";
"ppp" = "PPP";
"tcpip" = "TCP/IP";
"ipv4" = "IPv4";
"ipv6" = "IPv6";
"dns" = "DNS";
"eap" = "802.1X";
"ethernet" = "Ethernet";
"modem" = "Modeemi";
"pppoe" = "PPPoE";
"proxies" = "Välipalvelimet";
"appletalk" = "AppleTalk";
"bonds" = "Sidoksen tila";
"wins" = "WINS";
"wwan" = "WWAN";
"vpnondemand" = "VPN on Demand";
"vpnoptions" = "Valinnat";

"8021X" = "802.1X";

/* service list column titles */
"Services" = "Palvelut";
"Active Services" = "Aktiiviset palvelut";
"Inactive Services" = "Inaktiiviset palvelut";
"All Services" = "Kaikki palvelut";
"All Broadband Services" = "Kaikki laajakaistapalvelut";
"All VPN Services" = "Kaikki VPN-palvelut";
"All Wireless Services" = "Kaikki langattomat palvelut";
"All Dial-up Services" = "Kaikki soittosarjapalvelut";

"All Active Services" = "Kaikki aktiiviset palvelut";
"Active Broadband Services" = "Aktiiviset laajakaistapalvelut";
"Active VPN Services" = "Aktiiviset VPN-palvelut";
"Active Wireless Services" = "Aktiiviset langattomat palvelut";
"Active Dial-up Services" = "Aktiiviset soittosarjapalvelut";

/* action popup tooltip */
"ACTION_MENU_TOOLTIP" = "Aseta palvelujärjestys ja muut toiminnot";

/* Ethernet ID tooltip */
"EthernetID Tooltip" = "Tämän verkkolaitteen MAC-tunniste";
"AirPortID Tooltip" = "Tämän verkkolaitteen MAC-tunniste (sama kuin AirPort-tunnus)";

/* IP Address Validation strings */
"InvalidIPAddress" = "Virheellinen IP-osoite";
"InvalidSubnetMask" = "Virheellinen aliverkon peite";
"InvalidRouterAddress" = "Virheellinen reitittimen osoite";
"InvalidServerAddress" = "Virheellinen palvelimen osoite";
"InvalidDomainLabel" = "Virheellinen domainteksti";
"LinkLocalAddress" = "Link Local -osoite";
"InvalidPrefixLength" = "Virheellinen etuliitteen pituus";

// =-=-= IP Address Error reason strings =-=-=
"BasicValidationError"	= "IP-osoite koostuu neljästä numerosarjasta, arvoiltaan 0 - 255 ja jotka on erotettu pisteellä.";
"BasicSubnetMaskError"	= "Aliverkon peitteen on koostuttava neljästä numerosarjasta, arvoiltaan 0 - 255 ja jotka on erotettu pisteellä.";
"DefaultRouteError"	= "Syötetty arvo on varattu oletusreitille eikä sitä voida käyttää tietokoneen IP-osoitteena.";
"LimitedBroadcastError"	= "Syötetty arvo on rajoitettu lähetysosoite eikä sitä voida käyttää tietokoneen IP-osoitteena.";
"FirstQuadReservedError"	= "Syötetyn arvon ensimmäinen neljännes on alueen ulkopuolella eikä sitä voida käyttää reitittimen osoitteena.";
"SourceAddressError"	= "Arvon ensimmäinen neljännes ei voi olla nolla.";
"LoopbackError"	= "Arvon ensimmäinen neljännes ei voi olla 127.";
"BroadcastAddressError"	= "Palvelimen osoite ei voi olla sama kuin lähetysosoite.";
"NetworkAddressError"	= "Palvelimen osoite ei voi olla 0.";

// IP Address Octet value error reasons
"OctetMatchError"	= "IP-osoitteen verkko-osoiteosio ei vastaa aliverkon osoitetta.";
"OctetRangeError"	= "IP-osoite ei ole reitittimen osoitteen ja aliverkon peitteen tukemalla osoitealueella.";

// IP and Router match error
"IPRouterMatchError"= "IP-osoite ei voi olla sama kuin reitittimen osoite.";

// IP Address Link Local Address
"LinkLocalError" = "IP-osoite ei ole reititettävä. On suositeltavaa syöttää eri IP-osoite.";

// subnet maskk error reasons
"NonContiguousOnesError" = "Aliverkon peite on virheellinen. Tarkista, että olet kirjoittanut sen oikein. Lisätietoja saat verkon ylläpitäjältä.";

// DNS Search Domain errors
"SearchDomainLabelError" = "Etsintädomainnimet voivat sisältää vain kirjaimia, numeroita ja väliviivoja ja niiden on alettava ja loputtava kirjaimeen tai numeroon.";

// IPv6 address errors
"IPv6BasicValidationError" = "IPv6-osoite koostuu kahdeksasta kaksoispistein erotetusta heksadesimaalinumerosta väliltä 0x0 - 0xFFFF.";
"IPv6RouterBasicValidationError" = "IPv6-reitittimen osoite koostuu kahdeksasta kaksoispistein erotetusta heksadesimaalinumerosta väliltä 0x0 - 0xFFFF.";
// see RFC 3627 for reason less than 127 is recommended
"IPv6PrefixLengthError" = "IPv6-etuliitteen pituus on kokonaisluku väliltä 0 - 128. Syötetyn arvon on suositeltavaa olla pienempi kuin 127.";

/* DHCP ID length error strings */
"DHCP_ID_LENGTH_ERROR_TITLE" = "DHCP-asiakastunnus on liian pitkä";
"DHCP_ID_LENGTH_ERROR_MESSAGE" = "DHCP-asiakastunnuksessa ei voi olla enempää kuin 255 merkkiä.";


/* Connect time */
"TIME_HMS" = "%2.2d:%2.2d:%2.2d";
"TIME_1DHMS" = "1 päivä, %2.2d:%2.2d:%2.2d";
"TIME_DHMS" = "%d päivää, %2.2d:%2.2d:%2.2d";

/* data quantities for PPP */
"Bytes" = "tavua";
"KBytes" = "Kt";
"MBytes" = "Mt";

/* Location Sheet Tooltips */
"DUPLICATE_SET_TOOLTIP" = "Monista valittu käyttöpaikka";
"DUPLICATE_SERVICE_TOOLTIP" = "Monista valittu palvelu";
"DELETE_SET_TOOLTIP" =  "Poista valittu käyttöpaikka";
"DELETE_SERVICE_TOOLTIP" =  "Poista valittu palvelu";
"SERVICES_COLUMN_TITLE" = "Palvelut";
"LOCATIONS_COLUMN_TITLE" = "Käyttöpaikat";
"ADD_LOCATION_TOOLTIP" = "Lisää käyttöpaikka";
"DELETE_LOCATION_TOOLTIP" = "Poista valittu käyttöpaikka";

/* Location services sheet title format */
"LOCATION_SERVICES_TITLE" = "Valitse käyttöpaikkaan ”%@” lisättävät palvelut";

/* these are for the VPNImporter and any other app that imports configs */
"VPN_SHARED_SECRET" = "IPSec:n jaettu salaisuus";

/* Keychain */
"IC_KEYCHAIN" = "Internet-yhteys";
"8021x_KEYCHAIN" = "802.1X-salasana";
"IC_KEYCHAIN_FORMAT" = "Internet-yhteys: %@";

/* configuration popup menu item titles */
"Rename item" = "Nimeä uudelleen ”%@”…";
"Delete item" = "Poista ”%@”";

/* addRemove button tooltips */
"ADD_DNS_SERVER_TOOLTIP" = "Lisää DNS-palvelimen osoite";
"DELETE_DNS_SERVER_TOOLTIP" = "Poista DNS-palvelimen osoite";
"ADD_SEARCH_DOMAIN_TOOLTIP" = "Lisää DNS-etsintädomain";
"DELETE_SEARCH_DOMAIN_TOOLTIP" = "Poista DNS-etsintädomain";

"ADD_WINS_SERVER_TOOLTIP" = "Lisää WINS-palvelimen osoite";
"DELETE_WINS_SERVER_TOOLTIP" = "Poista WINS-palvelimen osoite";
"Add WINS server address" = "Lisää WINS-palvelimen osoite";
"Delete WINS server address" = "Poista WINS-palvelimen osoite";

"ADD_8021X_CONFIG_TOOLTIP" = "Lisää 802.1X-määrittely";
"DELETE_8021X_CONFIG_TOOLTIP" = "Poista 802.1X-määrittely";
"Add an 802.1x configuration" = "Lisää 802.1X-määrittely";
"Delete an 802.1x configuration" = "Poista 802.1X-määrittely";

"ADD_IPV6_ADDRESS_TOOLTIP" = "Lisää uusi IPv6-osoite";
"DELETE_IPV6_ADDRESS_TOOLTIP" = "Poista valittu IPv6-osoite";

"ADD_SERVICE_TOOLTIP" = "Luo uusi palvelu";
"REMOVE_SERVICE_TOOLTIP" = "Poista valittu palvelu";

"CURRENT_NETBIOS_NAME_FORMAT" = "%@ on käytössä.";

"CUSTOM_RANGE_FORMAT" = "( %d - %d )";
"MTU_RANGE_ERROR_TITLE" = "Arvo ei ole alueella";
"MTU_RANGE_ERROR_FORMAT_UNDER_MIN" = "Syötetty MTU-arvo on pienempi kuin liitännän tukema vähimmäisarvo (%d).";
"MTU_RANGE_ERROR_FORMAT_OVER_MAX" = "Syötetty MTU-arvo on suurempi kuin tämän liitännän tukema enimmäisarvo (%d).";
"MTU_RANGE_ERROR" = "Syötetty arvo ei ole tämän liitännän tukemien MTU-arvojen alueella.";

// proxy descriptions
"FTP Proxy" = "FTP-välipalvelin";
"Web Proxy (HTTP)" = "WWW-välipalvelin (HTTP)";
"Secure Web Proxy (HTTPS)" = "Suojattu WWW-välipalvelin (HTTPS)";
"Streaming Proxy (RTSP)" = "Virtaustoistovälipalvelin (RTSP)";
"SOCKS Proxy" = "SOCKS-välipalvelin";
"Gopher Proxy" = "Gopher-välipalvelin";
"Automatic Proxy Configuration" = "Autom. välipalvelimen määrittely";
"Auto Proxy Discovery" = "Autom. välipalvelimen löytäminen";
		
// proxy titles
"FTP Proxy Server" = "FTP-välipalvelin";
"Web Proxy Server" = "WWW-välipalvelin";
"Secure Web Proxy Server" = "Suojattu WWW-välipalvelin";
"Streaming Proxy Server" = "Virtaustoistovälipalvelin";
"SOCKS Proxy Server" = "SOCKS-välipalvelin";
"Gopher Proxy Server" = "Gopher-välipalvelin";
"Proxy Configuration File" = "Välipalvelimen määrittelytiedosto";

/* certificate alert strings */
"NO_CERT_ALERT_TITLE" = "Varmenteita ei löytynyt";
"NO_CERT_ALERT_INFO" = "Varmennetodentamista ei voida käyttää, koska avainnipussa ei ole sopivia varmenteita. Voit tuoda sopivat varmenteet avainnippuun Avainnipun käyttö -ohjelmalla. Jos sinulla ei ole todentamiseen tarvittavia varmenteita, ota yhteyttä verkon ylläpitäjään.";
"NO_CERT_MACHINE_ALERT_TITLE" = "Tietokonevarmenteita ei löytynyt";
"NO_CERT_MACHINE_ALERT_INFO" = "Varmennetodentamista ei voida käyttää, koska avainnipussa ei ole sopivia varmenteita. Voit tuoda sopivat varmenteet avainnippuun Avainnipun käyttö -ohjelmalla. Jos sinulla ei ole todentamiseen tarvittavia varmenteita, ota yhteyttä verkon ylläpitäjään.";
"NO_CERT_ALERT_OK" = "OK";
"NO_CERT_SELECTED" = "Ei valintaa";
"SELECT_USER_CERT_TITLE" = "Valitse käyttäjän todentamisvarmenne:";
"SELECT_TLS_CERT_TITLE" = "Valitse TLS-varmenne:";
"SELECT_MACHINE_CERT_TITLE" = "Valitse tietokoneen todentamisvarmenne:";
"SELECT_CERT_INFO" = "Ei valintaa";
"CERT_NOT_FOUND" = "Ei avainnipussa";
"CERT_NOT_FOUND_TOOLTIP" = "Valittu varmenne ei ole enää avainnipussa";

// advanced VPNOnDemand tooltips and AX overrides
"ADD_VPN_DOMAIN" = "Lisää uusi domain luetteloon";
"REMOVE_VPN_DOMAIN" = "Poista valittu domain luettelosta";
"Add VPN on Demand domain" = "Lisää VPN on Demand -domain";
"Remove VPN on Demand domain" = "Poista VPN on Demand -domain";

/* normally redial timeout is specified in seconds. set this to "YES" to specify redial timeout in minutes. */
/* Japanese Law requires this value to be in minutes, so Japanese translations should set this to "YES". */
/* Others should leave it set to "NO". */
"REDIAL_IN_MINUTES" = "NO";
"MINUTES_LABEL" = "minuuttia ennen uudelleenvalintaa"; 

/* 802.1x dialog strings */
"ONEX_TLS_TITLE" = "TLS:n laittaminen päälle aiheuttaa todentamisen epäonnistumisen.";
"ONEX_TLS_INFO" = "TLS:ää ei voida ottaa käyttöön, koska avainnipussa ei ole sopivia varmenteita. Voit tuoda asianmukaiset varmenteet avainnippuun Avainnipun käyttö -ohjelmalla. Jos sinulla ei ole todentamiseen tarvittavia varmenteita, ota yhteyttä verkon ylläpitäjään.";
"NO_CERTS" = "Varmenteita ei löytynyt";
"TLS_DESC" = "Valitse TLS-varmenne:";

"ONEX_OFF_STATUS" = "802.1X on pois käytöstä";
"ONEX_ON_STATUS" = "802.1X on käytössä";
"ONEX_INACTIVE_STATUS" = "802.1X ei ole käytössä";
"TURN_ONEX_OFF" = "Poista 802.1X käytöstä";
"TURN_ONEX_ON" = "Ota 802.1X käyttöön";

"ONEX_LOGIN_OFF_STATUS" = "802.1X-kirjautuminen";
"ONEX_LOGIN_ON_STATUS" = "802.1X-kirjautuminen";
"TURN_LOGIN_ONEX_OFF" = "Poista käytöstä";
"TURN_LOGIN_ONEX_ON" = "Ota käyttöön";

"ENABLE_8021X_TOOLTIP" = "Ota 802.1X-todentaminen käyttöön tai pois käytöstä tälle verkkopalvelulle osoittamalla.";
"ENABLE_8021X_TOOLTIP_NEED_NAME" = "802.1X-todentamisen käyttöönotto edellyttää käyttäjätunnusta ja salasanaa.";
"ONEX_AUTH_BUTTON_TOOLTIP" = "Todenna käyttäen 802.11x-määrittelyä osoittamalla";
"ONEX_LOGIN_CREDS_TOOLTIP" = "Käyttäjätunnusta ja salasanaa käytetään vain varmenteen hakemiseen ja sen luottamuksen asettamiseen. Niitä ei tallenneta.";

/* Authentication information */
"ONEX_AUTH_FAILED" = "802.1X-todentaminen epäonnistui.";
"ONEX_CLIENT_STATUS_FAILED" = "802.1X ei voi toidentaa. Annettu määrittely on ehkä virheellinen. Jos et tiedä mitä määrittelyä käyttää, ota yhteyttä verkon ylläpitäjään."; 
"ONEX_PROTOCOL_FAILURE" = "Yhtä tai useampaa yhdistämiseen käytettävää sisäistä protokollaa ei tueta. Jos et tiedä mitä sisäistä protokollaa käyttää, ota yhteyttä verkon ylläpitäjään."; 
"ONEX_INNER_PROT_FAILURE" = "Yhtä tai useampaa yhdistämiseen käytettävää sisäistä protokollaa ei tueta. Jos et tiedä mitä sisäistä protokollaa käyttää, ota yhteyttä verkon ylläpitäjään."; 
"ONEX_SECURITY_ERROR" = "Suojausvirhe: %d";
"ONEX_ERROR_PORT" = "( Virhe: %1$d portissa %2$@ )";

"ONEX_AUTHENTICATING" = "Todennetaan";
"ONEX_CONNECTED" = "Todennettu";
"ONEX_CONNECTED_VIA" = "Todennettu menetelmällä %@";
"ONEX_CONNECTED_VIA_PROT" = "Todennettu kohteen %@ kautta (%@)";
"ONEX_ELAPSED_TIME" = "Yhteysaika: %@";
"ONEX_NO_AUTHENTICATOR" = "Todentamispalvelin ei vastaa";

"ONEX_PROGRESS_TITLE" = "Määritellään %@-asetuksia kohteelle %@";
"ONEX_PROGRESS_STEP_AUTH" = "Todennetaan…";
"ONEX_PROGRESS_STEP_TRUST" = "Asetetaan luottamusta…";

"ONEX_SYSTEM_DOMAIN" = "Järjestelmäprofiilit";
"ONEX_LOGINWINDOW_DOMAIN" = "Kirjautumisikkunaprofiilit";
"ONEX_USER_DOMAIN" = "Käyttäjäprofiilit";
"ONEX_SYSTEM_CONFIG" = "Järjestelmän kuvaus";
"ONEX_LOGINWINDOW_CONFIG" = "Kirjautumisikkuna";

"ONEX_REPLACE_SYSTEM_CONFIG_TITLE" = "Korvataanko järjestelmäprofiili?";
"ONEX_REPLACE" = "Korvaa";
"ONEX_REPLACE_SHEET_INFO" = "Korvataanko järjestelmäprofiili profiililla ”%@”?";

"ONEX_NETWORK_NAME_IN_CONFIG_ALREADY_TITLE" = "Tällä verkolla on jo profiili.";
"ONEX_NETWORK_NAME_IN_CONFIG_ALREADY_INFO" = "Toisen profiilin luominen tälle verkolle saattaa haitata automaattista verkkoon liittymistä.";

/* status strings */
"UNKNOWN_SUMMARY" = "Verkkoyhteyden tilaa ei voida määrittää.";
"UNKNOWN_STATUS" = "Verkon tilaa ei tiedetä";

/* airport tooltips */
"ADD_NETWORK_TOOLTIP" = "Lisää ensisijainen verkko luetteloon";
"DELETE_NETWORK_TOOLTIP" = "Poista verkko ensisijaisten verkkojen luettelosta";

/* Status View AirPort Specific */
"AIRPORT_OFF" = "%@ on pois päältä";
"AIRPORT_ON" = "%@ on päällä";
"AIRPORT_CONNECTED" = "%@ on yhteydessä verkkoon.";
"AIRPORT_UNKNOWN" = "Langattoman yhteyden tilaa ei tiedetä.";
"AIRPORT_NO_NETWORK" = "Verkkoa ei ole valittu";

/* airport status summary strings */
"AIRPORT_NOT_CONNECTED_TO_NETWORK" = "%@ on päällä, mutta ei yhteydessä verkkoon.";
"AIRPORT_CONNECTED_TO" = "%1$@ on yhteydessä kohteeseen %2$@.";
"AIRPORT_CONNECTED_TO_IBSS" = "%1$@ on yhteydessä tietokoneiden väliseen verkkoon %2$@.";
"AIRPORT_NO_IP" = "Kohteella %@ ei ole IP-osoitetta eikä se voi yhdistää internetiin.";
"AIRPORT_NO_IP_CONFIGMETHOD" = "%1$@ on määritelty vastaanottamaan IP-osoite menetelmällä %2$@, mutta sillä ei ole IP-osoitetta eikä se saa yhteyttä internetiin.";
"AIRPORT_CONNECTED_WITH_IP" = "%1$@ on yhteydessä kohteeseen %2$@ ja sen IP-osoite on %3$@.";
"AIRPORT_LINK_LOCAL" = "Palvelulla %@ on itsensä määrittelemä IP-osoite %@ eikä se kykene muodostamaan internet-yhteyttä.";
"AIRPORT_NO_ROUTER" = "Tukiaseman kanssa ei voida viestiä. Varmista, että tukiasema on asennettu oikein.";
"AIRPORT_NO_REACH_IP" = "%@ on yhteydessä langattomaan verkkoon, mutta tukiaseman tilaa ei voida selvittää. Saatat olla yhteydessä internetiin.";
"AIRPORT_NO_DNS" = "%@ on yhteydessä internetiin, mutta DNS-asetuksia ei ehkä ole asetettu oikein.";
"AIRPORT_INTERNET_SHARING" = "Internet-jako on päällä ja käyttää kohdetta %@ yhteyden jakamiseen.";

/* airport interface join networks switch */
"AIRPORT_JOIN_AUTOMATICALLY_ON" = "Tunnettuihin verkkoihin liitytään automaattisesti. Jos tunnettuja verkkoja ei ole käytettävissä, sinulta kysytään ennen uuteen verkkoon liittymistä.";
"AIRPORT_JOIN_AUTOMATICALLY_OFF" = "Tunnettuihin verkkoihin liitytään automaattisesti. Jos tunnettuja verkkoja ei ole käytettävissä, joudut valitsemaan verkon käsin.";


/* Status View Ethernet Specific */
"ETHERNET_ACTIVE" = "%@ on aktiivinen";
"ETHERNET_NOT_ACTIVE" = "%@ ei ole aktiivinen";
"ETHERNET_CONNECTED" = "%@ on yhteydessä";
"ETHERNET_NOT_CONNECTED" = "%@ ei ole yhteydessä";

/* ethernet status summary strings */
"ETHERNET_ACTIVE_INFO" = "%1$@ on aktiivinen ja sen IP-osoite on %2$@.";
"ETHERNET_PLUGGED_NOT_CONNECTED" = "Kohteen %@ kaapeli on liitetty, mutta tietokoneella ei ole IP-osoitetta.";
"ETHERNET_NOT_PLUGGED" = "Joko kohteen %@ kaapelia ei ole liitetty tai toisessa päässä oleva laite ei vastaa.";
"ETHERNET_LINK_LOCAL" = "Palvelulla %@ on itsensä määrittelemä IP-osoite eikä se kykene muodostamaan internet-yhteyttä.";
"ETHERNET_NO_ROUTER" = "Verkon tila ei voi kommunikoida reitittimen kanssa.";
"ETHERNET_NO_REACH_IP" = "%@ on yhteydessä paikallisverkkoon, mutta Verkon tila ei voi varmistaa, että olet yhteydessä internetiin.";
"ETHERNET_NO_DNS" = "%@ on yhteydessä, mutta DNS ei toimi oletetulla tavalla ja sitä ei ehkä ole määritelty oikein.";
"ETHERNET_LOOPBACK" = "Kohteella %@ on loopback IP -osoite ja se ei ehkä voi muodostaa yhteyttä.";

/* Bluetooth PAN */
"DEVICE_NOT_CONNECTED_FORMAT" = "%1$@ ei ole yhteydessä.";

/* iPhone USB */
"USB_NOT_PLUGGED" = "Joko kohteen %@ kaapelia ei ole liitetty tai laite ei vastaa.";

/* FireWire status summary strings */
"FIREWIRE_NOT_CONNECTED" = "FireWire-laitteita, joissa on verkkotoiminto, ei ole liitetty.";

/* Modem Status View */
"MODEM_NOT_CONFIGURED" = "%@ ei ole määritelty";
"MODEM_CONNECTED" = "%@ on yhteydessä";
"MODEM_NOT_CONNECTED" = "%@ ei ole yhteydessä";

/* Modem Status Summary */
"MODEM_NO_SETTINGS" = "%@ ei ole määritelty.";
"MODEM_READY" = "Yhdistä verkkoon osoittamalla Yhdistä-painiketta.";

/* VPN Simple Status */
"VPN_INACTIVE" = "%@ on inaktiivinen";
"VPN_CONNECTED" = "%@ on yhteydessä";
"VPN_CONNECTING" = "%@ muodostaa yhteyttä…";
"VPN_DISCONNECTING" = "%@ katkaisee yhteyttä…";
"VPN_NOT_CONNECTED" = "%@ ei ole yhteydessä";
"VPN_UNKNOWN_STATE" = "%@ on tuntemattomassa tilassa";
"VPN_NOT_CONFIGURED" = "%@ ei ole määritelty";

/* Link aggregation service */
"LINK_ALERT_TITLE" = "Nykyiset määritykset menetetään";
"LINK_ALERT_EXISTING_CONFIG" = "Valittujen linkkien nykyiset määritykset menetetään. Haluatko varmasti luoda yhdistelmän?";
"LINK_STATUS_SPEED_DOWN" = "alhaalla";
"LINK_STATUS_ENABLED" = "OK";
"LINK_STATUS_INVALID" = "Virheellinen linkki";
"LINK_STATUS_NO_PARTNER" = "Ei kumppania";
"LINK_STATUS_NOT_ACTIVE_GROUP" = "Väärä ryhmä";
"LINK_STATUS_UNKNOWN" = "Tuntematon";
"LINK_STATUS_TOOLTIP_ENABLED" = "Ongelmia ei havaittu.";
"LINK_STATUS_TOOLTIP_INVALID" = "Linkin tila ei kelpaa (ei toimi, half-duplex, väärä nopeus tms.).";
"LINK_STATUS_TOOLTIP_NO_PARTNER" = "Kytkimen siinä portissa, johon laite on liitetty, ei ole 802.3ad Link Aggregationia päällä.";
"LINK_STATUS_TOOLTIP_NOT_ACTIVE_GROUP" = "Portti on yhteydessä kumppaniin, mutta linkkiyhdistelmä on eri kuin aktiivisena oleva.";
"LINK_STATUS_TOOLTIP_UNKNOWN" = "Laitteen tilaa ei voitu selvittää.";

/* import/export */
"ALERT_IMPORT_FAILED_TITLE" = "Määrittelyjä kohteelle ”%@” ei voitu tuoda.";
"ALERT_IMPORT_FAILED_MESSAGE" = "”%@”-palveluja ei löytynyt.";
"ALERT_IMPORT_FAILED_NO_SERVICES" = "Kohteen ”%@” määrittelyitä ei voitu tuoda, koska palvelua ”%@” ei ole otettu käyttöön Verkko-asetuksissa.";
"IMPORT_FAILED_BAD_FILE" = "Tuonti epäonnistui, koska tiedosto on virheellinen.";
"IMPORT_MULTIPLE_FORMAT" = "Löydettiin useita %@-palveluja. Valitse palvelu, johon määrittelyt tuodaan:";
"IMPORT_MULTIPLE_8021X_FORMAT" = "Useita menetelmää %@ tukevia palveluita löydettiin. Valitse palvelu, johon määrittelyt tuodaan:";
"EXPORT_FAILED" = "Vienti epäonnistui.";
"EXPORT_FAILED_FILE" = "Määrittelyjä ei voida kirjoittaa tiedostoon.";
"EXPORT_FAILED_CONFIGS" = "Määrittelyjä ei voida kirjoittaa tiedostoon, koska yhtään määrittelyä ei ole olemassa.";
"EXPORT_FAILED_CHECKBOXES" = "Määrittelyjä ei voida kirjoittaa tiedostoon, koska yhtään valintaneliötä ei ole valittuna.";
"EXPORT_FAILED_FILE_8021x" = "802.1X-profiileja ei voida kirjoittaa tiedostoon.";
"EXPORT_FAILED_PROFILES" = "802.1X-profiileja ei voida kirjoittaa tiedostoon, koska yhtään profiilia ei ole olemassa.";
"EXPORT_FAILED_CHECKBOXES_8021x" = "802.1X-profiileja ei voida kirjoittaa tiedostoon, koska yhtään valintaneliötä ei ole valittuna.";

"EXPORT_UNTITLED_FILE" = "Nimetön";


/* assist me sheet */
/* strings for the assist me alert sheet  */
"ASSIST_SHEET_TITLE" = "Tarvitsetko apua uuden verkkomäärittelyn tekemisessä tai verkkoyhteyteen liittyvän ongelman ratkaisemisessa?";
"ASSIST_SHEET_INFO" = "Jos tarvitset apua uuden verkkomäärittelyn tekemisessä, osoita Apuri.\n\nJos tarvitset apua verkkoyhteyteen liittyvän ongelman ratkaisemisessa, osoita Vianmääritys.";

"ASSIST_SHEET_DEFAULT_BUTTON_TITLE" = "Apuri…";
"ASSIST_SHEET_OTHER_BUTTON_TITLE" = "Vianmääritys…";

/* appletalk strings */
"APPLETALK_ALRT" = "AppleTalk on käytössä toisessa verkkopalvelussa.";
"APPLETALK_ALRT_EXPLANATION" = "Haluatko poistaa AppleTalkin käytöstä kohteessa ”%@”?"; 
"APPLETALK_ALRT_DUP_SERVICE" = "AppleTalk voi olla aktiivisena vain yhdessä verkkoportissa kerrallaan. Jatkettaessa AppleTalk kytketään pois kohteessa ”%@”."; 

/* TCP/IP Advanced Sheet*/
"IPV6_ROUTER_NOT_AVAILABLE" = "Ei käytettävissä";

/* Show Menu Extra titles */
"SHOW_VPN_MENUEXTRA" = "Näytä VPN-tila valikkorivillä";
"SHOW_MODEM_MENUEXTRA" = "Näytä modeemin tila valikkorivillä";
"SHOW_WWAN_MENUEXTRA" = "Näytä WWAN-tila valikkorivillä";
"SHOW_PPPOE_MENUEXTRA" = "Näytä PPPoE:n tila valikkorivillä";
"SHOW_IRDA_MENUEXTRA" = "Näytä IrDA:n tila valikkorivillä";

/* Accessibility Strings */
"Location Actions" = "Käyttöpaikkatoiminnot";
"Add Location" = "Lisää sijainti";
"Delete Location" = "Poista sijainti";

"Add search domain" = "Lisää hakudomain";
"Delete search domain" = "Poista hakudomain";
"Add DNS server" = "Lisää DNS-palvelin";
"Delete DNS server" = "Poista DNS-palvelin";

"Add Service"= "Lisää palvelu";
"Delete Service" = "Poista palvelu";
"Service Actions" = "Palvelu-toiminnot";

"Add Profile"= "Lisää profiili";
"Delete Profile" = "Poista profiili";

"SERVICE_LOGO_FORMAT" = "%@ Logo";
"Service Logo" = "Palvelulogo";

/* IPSec VPN server requires prompt */
"SERVER_REQUIRES_PROMPT" = "Palvelin kysyy salasanaa";

/* Bluetooth PAN and iPhone support */
"NO_PAIRED_DEVICES_FOUND" = "PAN-laitteita ei löytynyt";